{
    "reviews": [
        {
            "author_name": "Mike L",
            "rating": 5,
            "time": "2 weeks ago",
            "text": "Jobin and his team did an amazing job on our complete gutter replacement including leaf guards. They had the most competitive price yet we don't feel we had to sacrifice quality. Highly recommend!!"
        },
        {
            "author_name": "Lenis David",
            "rating": 5,
            "time": "6 weeks ago",
            "text": "I highly recommend Mo City Gutters & Remodeling. I needed some help fixing a few windows that broke during Beryl. They were quick with their turnaround, gave fair pricing and did a fantastic job matching the window to the other windows."
        },
        {
            "author_name": "Bob Savigny",
            "rating": 5,
            "time": "7 weeks ago",
            "text": "In the aftermath of Beryl, contractors were terrible about returning calls or giving quotes on smaller jobs. These guys were responsive, reasonably priced, and did top quality, professional work. Delivered as promised in all regards."
        },
        {
            "author_name": "Samuel Lincoln, III",
            "rating": 5,
            "time": "8 weeks ago",
            "text": "I recently had gutters installed and repaired by Mo City Gutters, and I couldn't be happier! They matched my colors perfectly and were incredibly punctual throughout the process. The team was professional and efficient, making the entire experience smooth and stress-free. Highly recommend them for anyone in need of gutter services!"
        },
        {
            "author_name": "Chandy Abraham",
            "rating": 5,
            "time": "10 weeks ago",
            "text": "We have been meaning to remove the carpet in our guest bath that the builders inexplicably placed years ago. Mo City Gutters & Remodeling did a marvelous job replacing it with tile! They worked meticulously to ensure that the tiles fit seamlessly around the base of the sink. And they completed the job in a timely manner and made sure to leave the work space very clean. Also Jobin did an amazing job communicating with us during the entire project. I highly recommend them for any home remodeling needs!"
        },
        {
            "author_name": "Sandra Robinson",
            "rating": 5,
            "time": "10 weeks ago",
            "text": "They were prompt and efficient. Answered all my questions and concerns."
        },
        {
            "author_name": "Maria Luisa Cepeda",
            "rating": 5,
            "time": "10 weeks ago",
            "text": "My neighbor and I recently hired Moe City Gutters to fix our home's gutters that had been damaged by the recent storm. I am extremely happy with the results. From the initial consultation to the final inspection, their team was professional, prompt, and knowledgeable. They quickly identified the issue and provided a clear solution to replace the damaged gutter, all while staying within budget. The quality of their work is outstanding, and my gutters are now functioning perfectly. I highly recommend them to anyone in need of gutter services!"
        },
        {
            "author_name": "Mike H",
            "rating": 5,
            "time": "11 weeks ago",
            "text": "I had a great experience with Mo City. The quality of work and professionalism were great. You won't regret working with them!"
        },
        {
            "author_name": "Jackie Lopez",
            "rating": 5,
            "time": "11 weeks ago",
            "text": "Great work and service!! Work was completed quickly. Loved the results."
        },
        {
            "author_name": "Edgar Villatoro",
            "rating": 5,
            "time": "11 weeks ago",
            "text": "Jobin and his crew did an amazing job at my house. The house got a major facelift. Very attentive, reasonable pricing, and walks you through the entire process. Will recommend!!!"
        },
        {
            "author_name": "Changhua Hu",
            "rating": 5,
            "time": "12 weeks ago",
            "text": "Very professional and extremely satisfied with the work so far. It is a very good experience to deal with."
        },
        {
            "author_name": "Victoria Cummings",
            "rating": 5,
            "time": "13 weeks ago",
            "text": "Very professional. Responded quickly to my initial inquiry and quickly provided a quote. Some parts of my gutter hadn't been cleaned for a LONG time. We set up an appt and his employees came when they said they would and worked quickly. Let me know when they were done. I didn't get up on the roof to check their work, but from the areas I could see, they did a complete job. Thanks, MO City!"
        },
        {
            "author_name": "Veena Fernandes",
            "rating": 5,
            "time": "14 weeks ago",
            "text": "Mo City gutters did a great job with replacing my partial gutter with leaf filter. Also cleaned my clogged gutters. I strongly recommend them for keeping up with their appointment time and workmanship with quality."
        },
        {
            "author_name": "Anish Thomas",
            "rating": 5,
            "time": "14 weeks ago",
            "text": "I got fence repair work done with Mo City. Their price was very competitive. But he also provided top notch service from beginning to end to ensure everything went smoothly. They are very professional, friendly, and easy to work with. Will use them for future projects."
        },
        {
            "author_name": "Khaled Kazmi",
            "rating": 5,
            "time": "14 weeks ago",
            "text": "On time, answers all his calls and takes care of business the right way. I will continue to recommend Jobin and this company."
        },
        {
            "author_name": "Greg Schurter",
            "rating": 5,
            "time": "16 weeks ago",
            "text": "Definitely recommend Mo city gutters. They gave a quick quote and great price. Communications were great and they completed the work as agreed. Actually did a bit extra. And everything was cleaned up before they left.",
            "review_count": "5 reviews",
            "photo_count": "0 photos"
        }
    ]
}
